Tekla.Structures.Model.PourUnit
The PourUnit class represents a pour unit in the model.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam beam = new Beam(new Point(1000, 1000, 400), new Point(3000, 1000, 400));
beam.Profile.ProfileString = "380*380";
beam.Material.MaterialString = "K40-1";
beam.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam.Insert())
{
Beam beam2 = new Beam(new Point(800, 1000, 0), new Point(800, 1000, 3000));
beam2.Profile.ProfileString = "380*380";
beam2.Material.MaterialString = "K40-1";
beam2.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam2.Insert())
{
new Model().CommitChanges();
ModelObjectEnumerator pours = beam.GetPours();
while (pours.MoveNext())
{
PourObject pour = pours.Current as PourObject;
if (pour != null)
{
Solid solid = pour.GetSolid();
if (solid != null)
Console.WriteLine("Fetching solid from pour successfully!");
PourUnit pourUnit = pour.GetFatherPourUnit();
pourUnit.Name = "test";
pourUnit.Modify();
new Model().CommitChanges();
}
}
}
}
}
}

Tekla.Structures.Model.PourUnit.Name
Gets or sets the name of the pour unit.

Tekla.Structures.Model.PourUnit.Insert
At the moment pour units cannot be inserted.
Returns: Returns false.

Tekla.Structures.Model.PourUnit.Select
Selects the pour unit instance from the model. The identifier of the instance must be set.
Returns: True on success.

Tekla.Structures.Model.PourUnit.Modify
Modifies the pour unit with the given identifier.
Returns: True on success.

Tekla.Structures.Model.PourUnit.Delete
At the moment pour units cannot be deleted.
Returns: Returns false.

Tekla.Structures.Model.PourUnit.GetObjects
Returns all objects related to pour unit, pour object not included.
Returns: A list of model object on success, otherwise null.

Tekla.Structures.Model.PourUnit.GetPourObject
Returns the pour object in pour unit.
Returns: The pour object

Tekla.Structures.Model.PourUnit.ToStruct(Tekla.Structures.ModelInternal.dotPourUnit_t@)
To the structure.
PourUnit: The PourUnit.

Tekla.Structures.Model.PourUnit.FromStruct(Tekla.Structures.ModelInternal.dotPourUnit_t@)
From the structure.
PourUnit: The PourUnit.

Tekla.Structures.Model.PourUnit.SelectInstance
Selects the instance.
Returns: Returns true if can be selected.

Tekla.Structures.Model.PourUnit.ModifyInstance
Modifies the instance.
Returns: Returns true if modified.